# 1. Простые числа (делится только на 1 и на себя)
n = int(input("N: "))  # Считываем конечное число диапазона и преобразуем его в целое (int)
for num in range(2, n + 1):  # Перебираем все числа от 2 (первое простое число) до N включительно
    for i in range(2, int(num**0.5) + 1):  # Проверяем делители от 2 до квадратного корня из числа (для скорости)
        if num % i == 0: break  # Если число делится на i без остатка, оно не простое — выходим из внутреннего цикла
    else: print(num, end=" ")  # Если цикл завершился без break, значит делителей нет — выводим простое число

# 2. Замена пробелов
s = input("\nСтрока: ")  # Получаем от пользователя строку текста
# Используем метод .replace(), чтобы найти все пробелы и заменить их на нижнее подчеркивание
print(s.replace(" ", "_"))

# 3. Массив (кратные 3 -> 0)
arr = [3, 5, 9, 10, 12, 15, 1, 2]  # Задаем исходный массив чисел
# С помощью генератора списка проверяем каждое число: если оно делится на 3 без остатка, ставим 0, иначе оставляем само число
res = [0 if x % 3 == 0 else x for x in arr]
print("Итог:", res)  # Выводим полученный массив, где все числа, кратные 3, заменены нулями
